//ACCPCNY  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*CNY Currency Trade Acceptance/Matching
//*
//ACCPCNY  EXEC TRDPROC,RUNPARM='ACCPCNY'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPCNY)
