//ACCPEUR  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*EUR Currency Trade Acceptance/Matching
//*
//ACCPEUR  EXEC TRDPROC,RUNPARM='ACCPEUR'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPEUR)
