//ACCPUSD  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*USD Currency Trade Acceptance/Matching
//*
//ACCPUSD  EXEC TRDPROC,RUNPARM='ACCPUSD'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPUSD)
