//ACCPMXN  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*MXN Currency Trade Acceptance/Matching
//*
//ACCPMXN  EXEC TRDPROC,RUNPARM='ACCPMXN'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPMXN)
