//ACCPCAD  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*CAD Currency Trade Acceptance/Matching
//*
//ACCPCAD  EXEC TRDPROC,RUNPARM='ACCPCAD'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPCAD)
