//ACCPGBX  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*GBX Currency Trade Acceptance/Matching
//*
//ACCPGBX  EXEC TRDPROC,RUNPARM='ACCPGBX'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPGBX)
