//ACCPCHF  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*CHF Currency Trade Acceptance/Matching
//*
//ACCPCHF  EXEC TRDPROC,RUNPARM='ACCPCHF'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(ACCPCHF)
