//SETLJPY  JOB (QA),'QA',CLASS=D,MSGCLASS=X,
//         COND=(8,LT)
//*
//PROCLIB  JCLLIB ORDER=CLOUDFRM.TRADING.BATCHDB2.RUN.PROC
//*
//*JPY Currency Trade Settlement
//*
//SETLJPY  EXEC TRDPROC,RUNPARM='SETLJPY'
//SYSTSIN  DD DISP=SHR,DSN=CLOUDFRM.TRADING.BATCHDB2.CARD(SETLJPY)
